<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"2fa155a6f74f44a7799640a114272478a5e16d617ff9250cb4891a0374999075","plan_job_ref":"Job CICD for Splitrr Infra #9 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10654738025","plan_out_hash":"fa67651d7b9c2abdde1054266b50b42d6f841ce84ee4e41ec6637245b7c59804","plan_hash":"3edf7533e2ba65053460550cbad88843ceb0e13d5f4509048f234e089966ae13","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 13 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.alb.aws_alb.golend_alb will be created
+   resource "aws_alb" "golend_alb" {
+       arn                                                          = (known after apply)
+       arn_suffix                                                   = (known after apply)
+       client_keep_alive                                            = 3600
+       desync_mitigation_mode                                       = "defensive"
+       dns_name                                                     = (known after apply)
+       drop_invalid_header_fields                                   = false
+       enable_deletion_protection                                   = false
+       enable_http2                                                 = true
+       enable_tls_version_and_cipher_suite_headers                  = false
+       enable_waf_fail_open                                         = false
+       enable_xff_client_port                                       = false
+       enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
+       id                                                           = (known after apply)
+       idle_timeout                                                 = 60
+       internal                                                     = false
+       ip_address_type                                              = (known after apply)
+       load_balancer_type                                           = "application"
+       name                                                         = "splitrr-dev-alb"
+       name_prefix                                                  = (known after apply)
+       preserve_host_header                                         = false
+       security_groups                                              = (known after apply)
+       subnets                                                      = [
+           "subnet-00cd8d95d55e658ac",
+           "subnet-05af162f25139917c",
        ]
+       tags                                                         = {
+           "Name" = "splitrr-dev-alb"
        }
+       tags_all                                                     = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb"
+           "Project" = "Splitrr"
        }
+       vpc_id                                                       = (known after apply)
+       xff_header_processing_mode                                   = "append"
+       zone_id                                                      = (known after apply)

+       subnet_mapping (known after apply)
    }

  # module.alb.aws_alb_listener.backend_end will be created
+   resource "aws_alb_listener" "backend_end" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags              = {
+           "Name" = "splitrr-dev-alb-listener"
        }
+       tags_all          = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb-listener"
+           "Project" = "Splitrr"
        }

+       default_action {
+           order = (known after apply)
+           type  = "redirect"

+           redirect {
+               host        = "#{host}"
+               path        = "/#{path}"
+               port        = "443"
+               protocol    = "HTTPS"
+               query       = "#{query}"
+               status_code = "HTTP_301"
            }
        }

+       mutual_authentication (known after apply)
    }

  # module.alb.aws_alb_listener.https_listener will be created
+   resource "aws_alb_listener" "https_listener" {
+       arn               = (known after apply)
+       certificate_arn   = "arn:aws:acm:us-east-1:949263681218:certificate/6016b782-65a8-4829-8015-6e37b0b3701d"
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-2021-06"
+       tags              = {
+           "Name" = "splitrr-dev-alb-https-listener"
        }
+       tags_all          = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb-https-listener"
+           "Project" = "Splitrr"
        }

+       default_action {
+           order = (known after apply)
+           type  = "fixed-response"

+           fixed_response {
+               content_type = "text/plain"
+               message_body = "Not Found"
+               status_code  = "404"
            }
        }

+       mutual_authentication (known after apply)
    }

  # module.alb.aws_security_group.lb will be created
+   resource "aws_security_group" "lb" {
+       arn                    = (known after apply)
+       description            = "controls access to the ALB"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
#                (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
#                (1 unchanged attribute hidden)
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
#                (1 unchanged attribute hidden)
            },
        ]
+       name                   = "splitrr-dev-alb-lb-sg"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "splitrr-dev-alb-lb-sg"
        }
+       tags_all               = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-alb-lb-sg"
+           "Project" = "Splitrr"
        }
+       vpc_id                 = "*********************"
    }

  # module.app_route53_record.aws_route53_record.site_domain will be created
+   resource "aws_route53_record" "site_domain" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "app"
+       type            = "A"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = true
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.backend_route53_record.aws_route53_record.site_domain will be created
+   resource "aws_route53_record" "site_domain" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "api"
+       type            = "A"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = true
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.secrets.aws_secretsmanager_secret.secret will be created
+   resource "aws_secretsmanager_secret" "secret" {
+       arn                            = (known after apply)
+       description                    = "Secret for environment variables"
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "splitrr-dev-secret-manager"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 30
+       tags                           = {
+           "Name" = "splitrr-dev-secret-manager"
        }
+       tags_all                       = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-secret-manager"
+           "Project" = "Splitrr"
        }
#        (1 unchanged attribute hidden)

+       replica (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.secret_version will be created
+   resource "aws_secretsmanager_secret_version" "secret_version" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # module.vpc.aws_cloudwatch_log_group.vpc_flow_log_group[0] will be created
+   resource "aws_cloudwatch_log_group" "vpc_flow_log_group" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       kms_key_id        = "***************************************************************************"
+       log_group_class   = (known after apply)
+       name              = "splitrr-dev-vpc-flow-log-group"
+       name_prefix       = (known after apply)
+       retention_in_days = 0
+       skip_destroy      = false
+       tags_all          = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
    }

  # module.vpc.aws_flow_log.vpc_flow_log[0] will be created
+   resource "aws_flow_log" "vpc_flow_log" {
+       arn                      = (known after apply)
+       iam_role_arn             = (known after apply)
+       id                       = (known after apply)
+       log_destination          = (known after apply)
+       log_destination_type     = "cloud-watch-logs"
+       log_format               = (known after apply)
+       log_group_name           = (known after apply)
+       max_aggregation_interval = 600
+       tags_all                 = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       traffic_type             = "ALL"
+       vpc_id                   = "*********************"
    }

  # module.vpc.aws_iam_role.vpc_flow_role[0] will be created
+   resource "aws_iam_role" "vpc_flow_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "splitrr-dev-vpc-flow-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.vpc.aws_iam_role_policy.vpc_flow_role_policy[0] will be created
+   resource "aws_iam_role_policy" "vpc_flow_role_policy" {
+       id          = (known after apply)
+       name        = "splitrr-dev-vpc-flow-role-policy"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "logs:PutLogEvents",
+                           "logs:DescribeLogStreams",
+                           "logs:DescribeLogGroups",
+                           "logs:CreateLogStream",
+                           "logs:CreateLogGroup",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role        = (known after apply)
    }

  # module.vpc.aws_kms_alias.cloudwatch_log_key_alias[0] will be created
+   resource "aws_kms_alias" "cloudwatch_log_key_alias" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/splitrr-dev-vpc-cloudwatch-key"
+       name_prefix    = (known after apply)
+       target_key_arn = (known after apply)
+       target_key_id  = "************************************"
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #9](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10654738025)